<?
//Подключаем заголовки ответа
header('Content-Type: application/json');
header('Access-Control-Allow-Origin: *');

///Роутер/////////////////////////////////////////////////////////////////////////////////////////////////////////////
function route($method, $urlData, $formData, $db) {
/////Получение одного юзера////////////////////////////////////////////////////
/////GET /users/{id}/////////////////////////////////////////////////////////// 
    if ($method === 'GET' && count($urlData) == 1) {
        //Добываем юзера из базы
        $id = $urlData[0];
        $quests =  $db->query("SELECT quests FROM Users WHERE id = $id")
        ->fetch_row()[0];
        
         // Выводим ответ клиенту
        echo json_encode(array(
            'status' => 'ok',
            'quests' => $quests
        ));
        return;
    }
////////////////////////////////////////////////////////////////////////////////  
///Возвращаем ошибку////////////////////////////////////////////////////////////
    else header('location:https://gt99.xyz/QuestAPI/error.html');
////////////////////////////////////////////////////////////////////////////////       
}
?>
